; domain
(define (domain emergency-carrier)
    (:requirements :strips :typing :action-costs)

    (:types
        drone person crate location content carrier num
    )

    (:predicates
        ;; Localización
        (at-drone ?d - drone ?l - location)
        (at-person ?p - person ?l - location)
        (at-crate ?c - crate ?l - location)
        (at-carrier ?ca - carrier ?l - location)

        ;; Estado del dron
        (holding ?d - drone ?c - crate)
        (drone-free ?d - drone)

        ;; Transportador
        (carrying ?d - drone ?ca - carrier)

        ;; Contenido
        (crate-has ?c - crate ?t - content)
        (person-has ?p - person ?t - content)

        ;; Cajas dentro del transportador
        (in ?c - crate ?ca - carrier)

        ;; Control numérico
        (carrier-load ?ca - carrier ?n - num)
        (carrier-capacity ?ca - carrier ?n - num)
        (siguiente ?n1 ?n2 - num)
    )

    (:functions
        (total-cost)
        (fly-cost ?from - location ?to - location)
    )

    ;; -----------------------------
    ;; COGER TRANSPORTADOR
    ;; -----------------------------
    (:action pick-up-carrier
        :parameters (?d - drone ?ca - carrier ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (at-carrier ?ca ?l)
        )
        :effect (and
            (not (at-carrier ?ca ?l))
            (carrying ?d ?ca)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; DEJAR TRANSPORTADOR
    ;; -----------------------------
    (:action drop-carrier
        :parameters (?d - drone ?ca - carrier ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
        )
        :effect (and
            (not (carrying ?d ?ca))
            (at-carrier ?ca ?l)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; MOVER SOLO DRON (coste variable)
    ;; -----------------------------
    (:action fly
        :parameters (?d - drone ?from - location ?to - location)
        :precondition (at-drone ?d ?from)
        :effect (and
            (not (at-drone ?d ?from))
            (at-drone ?d ?to)
            (increase (total-cost) (fly-cost ?from ?to))
        )
    )

    ;; -----------------------------
    ;; VOLAR CON TRANSPORTADOR (coste variable)
    ;; -----------------------------
    (:action fly-and-move-carrier
        :parameters (?d - drone ?ca - carrier ?from - location ?to - location)
        :precondition (and
            (at-drone ?d ?from)
            (carrying ?d ?ca)
        )
        :effect (and
            (not (at-drone ?d ?from))
            (at-drone ?d ?to)
            (increase (total-cost) (fly-cost ?from ?to))
        )
    )

    ;; -----------------------------
    ;; COGER CAJA
    ;; -----------------------------
    (:action pick-up
        :parameters (?d - drone ?c - crate ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (at-crate ?c ?l)
            (drone-free ?d)
        )
        :effect (and
            (not (at-crate ?c ?l))
            (not (drone-free ?d))
            (holding ?d ?c)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; PONER CAJA EN TRANSPORTADOR
    ;; -----------------------------
    (:action put-in-carrier
        :parameters (?d - drone ?c - crate ?ca - carrier ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
            (holding ?d ?c)
            (carrier-load ?ca ?n1)
            (carrier-capacity ?ca ?n2)
            (siguiente ?n1 ?n2)
        )
        :effect (and
            (not (holding ?d ?c))
            (drone-free ?d)
            (in ?c ?ca)
            (not (carrier-load ?ca ?n1))
            (carrier-load ?ca ?n2)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; SACAR CAJA DEL TRANSPORTADOR
    ;; -----------------------------
    (:action take-from-carrier
        :parameters (?d - drone ?c - crate ?ca - carrier ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
            (in ?c ?ca)
            (carrier-load ?ca ?n2)
            (siguiente ?n1 ?n2)
            (drone-free ?d)
        )
        :effect (and
            (holding ?d ?c)
            (not (drone-free ?d))
            (not (in ?c ?ca))
            (not (carrier-load ?ca ?n2))
            (carrier-load ?ca ?n1)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; ENTREGAR
    ;; -----------------------------
    (:action deliver
        :parameters (?d - drone ?c - crate ?p - person ?l - location ?t - content)
        :precondition (and
            (at-drone ?d ?l)
            (holding ?d ?c)
            (at-person ?p ?l)
            (crate-has ?c ?t)
        )
        :effect (and
            (person-has ?p ?t)
            (not (holding ?d ?c))
            (drone-free ?d)
            (increase (total-cost) 1)
        )
    )
)

; problem
(define (problem emergency_carrier_d1_r1_l5_p5_c5_g5)
(:domain emergency-carrier)
(:objects
	drone1 - drone
	carrier1 - carrier
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	n0 - num
	n1 - num
	n2 - num
	n3 - num
	n4 - num
)
(:init
	(= (total-cost) 0)
	(= (fly-cost depot depot) 0)
	(= (fly-cost depot loc1) 2058)
	(= (fly-cost depot loc2) 1723)
	(= (fly-cost depot loc3) 364)
	(= (fly-cost depot loc4) 1414)
	(= (fly-cost depot loc5) 1294)
	(= (fly-cost loc1 depot) 2058)
	(= (fly-cost loc1 loc1) 0)
	(= (fly-cost loc1 loc2) 820)
	(= (fly-cost loc1 loc3) 1694)
	(= (fly-cost loc1 loc4) 1366)
	(= (fly-cost loc1 loc5) 854)
	(= (fly-cost loc2 depot) 1723)
	(= (fly-cost loc2 loc1) 820)
	(= (fly-cost loc2 loc2) 0)
	(= (fly-cost loc2 loc3) 1405)
	(= (fly-cost loc2 loc4) 1690)
	(= (fly-cost loc2 loc5) 494)
	(= (fly-cost loc3 depot) 364)
	(= (fly-cost loc3 loc1) 1694)
	(= (fly-cost loc3 loc2) 1405)
	(= (fly-cost loc3 loc3) 0)
	(= (fly-cost loc3 loc4) 1151)
	(= (fly-cost loc3 loc5) 950)
	(= (fly-cost loc4 depot) 1414)
	(= (fly-cost loc4 loc1) 1366)
	(= (fly-cost loc4 loc2) 1690)
	(= (fly-cost loc4 loc3) 1151)
	(= (fly-cost loc4 loc4) 0)
	(= (fly-cost loc4 loc5) 1252)
	(= (fly-cost loc5 depot) 1294)
	(= (fly-cost loc5 loc1) 854)
	(= (fly-cost loc5 loc2) 494)
	(= (fly-cost loc5 loc3) 950)
	(= (fly-cost loc5 loc4) 1252)
	(= (fly-cost loc5 loc5) 0)
	(at-drone drone1 depot)
	(drone-free drone1)
	(at-carrier carrier1 depot)
	(carrier-load carrier1 n0)
	(carrier-capacity carrier1 n4)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(at-crate crate5 depot)
	(crate-has crate1 food)
	(crate-has crate2 food)
	(crate-has crate3 food)
	(crate-has crate4 medicine)
	(crate-has crate5 medicine)
	(at-person person1 loc1)
	(at-person person2 loc1)
	(at-person person3 loc1)
	(at-person person4 loc1)
	(at-person person5 loc2)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person4 medicine)
	(person-has person5 food)
))
(:metric minimize (total-cost))
)

; plan
1. (pick-up drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (drone-free drone1)
   added: (holding drone1 crate1)
   goals met: 1 of 6
2. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 0 of 6
3. (deliver drone1 crate1 person5 loc2 food)
   deleted: (holding drone1 crate1)
   added: (person-has person5 food) (drone-free drone1)
   goals met: 1 of 6
4. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 2 of 6
5. (pick-up drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (drone-free drone1)
   added: (holding drone1 crate4)
   goals met: 2 of 6
6. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 1 of 6
7. (deliver drone1 crate4 person2 loc1 medicine)
   deleted: (holding drone1 crate4)
   added: (person-has person2 medicine) (drone-free drone1)
   goals met: 2 of 6
8. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 3 of 6
9. (pick-up drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (drone-free drone1)
   added: (holding drone1 crate2)
   goals met: 3 of 6
10. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 2 of 6
11. (deliver drone1 crate2 person1 loc1 food)
   deleted: (holding drone1 crate2)
   added: (person-has person1 food) (drone-free drone1)
   goals met: 3 of 6
12. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 4 of 6
13. (pick-up drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (drone-free drone1)
   added: (holding drone1 crate3)
   goals met: 4 of 6
14. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 3 of 6
15. (deliver drone1 crate3 person2 loc1 food)
   deleted: (holding drone1 crate3)
   added: (person-has person2 food) (drone-free drone1)
   goals met: 4 of 6
16. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 5 of 6
17. (pick-up drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (drone-free drone1)
   added: (holding drone1 crate5)
   goals met: 5 of 6
18. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 4 of 6
19. (deliver drone1 crate5 person4 loc1 medicine)
   deleted: (holding drone1 crate5)
   added: (person-has person4 medicine) (drone-free drone1)
   goals met: 5 of 6
20. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 6 of 6
